sing = {'李白', '白居易', '李清照', '杜甫', '王昌龄', '王维', '孟浩然', '王安石'}
dance = {'李白', '李商隐', '杜甫', '白居易', '岑参', '王昌龄'}
rap = {'李清照', '刘禹锡', '岑参', '王昌龄', '苏轼', '王维', '李白'}

# set 支持很多运算符
# print(sing + dance) 不支持加法

# A - B 求A和B的差集    只在A不在B的
print(sing - dance)  # {'王维', '李清照', '王安石', '孟浩然'}
print(dance - sing)  # {'李商隐', '岑参'}

# A & B 求A和B的交集
print(sing & dance)  # {'李白', '王昌龄', '杜甫', '白居易'}

# A | B 求A和B的并集
print(sing | dance)  # {'王昌龄', '杜甫', '岑参', '李商隐', '白居易', '李白', '王安石', '李清照', '王维', '孟浩然'}

# A ^ B 求A和B的对称差值  只属于A或只属于B   ==》(A | B) - (A & B)
print(sing ^ dance)  # {'孟浩然', '李商隐', '王安石', '岑参', '王维', '李清照'}
