# 按位与&  按位或|  按位异或^  按位左移<<   按位右移>>   按位取反~

a = 23  #0b0001 0111
b = 15  #0b0000 1111

# 按位与& 同为1则为1，否则为0
print(a & b)  # 7
'''       23       0b 0001 0111
          15       0b 0000 1111
               ==> 0b 0000 0111=7
'''

# 按位或| 只要有一个为 1 则为 1
print(a | b) # 31
'''       23       0b 0001 0111
          15       0b 0000 1111
             ==> 0b 0001 1111=31
'''

# 按位异或^ 相同为0，不同为1
print(a ^ b) # 24
'''       23       0b 0001 0111
          15       0b 0000 1111
               ==> 0b 0001 1000=24
'''

# 按位左移  往左移动n位，，往后面补0  实际上 a<<n  ==> a * (2**n) a乘以2的n次方
x = 5    #0b 0000 0101
print(5 << 2) # 20
'''    5    0b 0000 0101
            0b 0001 0100  = 20
'''

# 按位右移
y = 15
print(y>>2)  # 3  ==>  a>>n  a除于2的n次方 取整
'''   15    0b 0000 1111
            0b 0000 0011  = 3
'''