# p232
# 判断用户输入的内容是否是数字，如果是数字，转换成为数字类型
# \d+ (\.? \d+)? ()=>>作为整体出现一次或多次    or  \d+\.?\d*
import re

# num = input('请输入一个数字')
# if re.fullmatch(r'\d+\.?\d*', num):
#     print('是一个数字')
# else:
#     print('不是一个数字')
#     print(float(num))


# 以非数字开头，后面有字母、数字_ 、 -组成的长度4-14位的字符串
# r'^\D[a-z0-9A-Z_\-]{3,13}

# 取出里面的内容
# x = re.search(r'go?d', 'gd')  # <re.Match object; span=(0, 2), match='gd'>
# print(x.group(0))  # gd

# 邮箱匹配规则
# r'^([A-Za-z0-9_\-\.])+@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$'
# 123123123@qq.com

# 手机号匹配规则

# 匹配身份证
#   xx xx xx前6位地区  出生年1800~2099 月份01~12      日01~31                      后4位
# r'[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$'